In [1]:
import pandas as pd

In [2]:
df = pd.read_json('dataset/json/simple.json')

In [3]:
df

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [4]:
df.head(5)

      name  age grade
0    Andew   12     A
1   Bhuvan   18     B
2  Clinton   11     A
3    Drake   12     C
4    Eisha   13     B

In [5]:
df.shape

(10, 3)

In [7]:
df_with_records = pd.read_json('dataset/json/simple_records.json', lines=True)

In [8]:
df_with_records

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [9]:
df_with_records.shape

(10, 3)

In [10]:
df_with_nested = pd.read_json('dataset/json/nested.json')

In [12]:
df_with_nested.shape

(10, 2)

In [13]:
df_with_nested.head(2)

   student_roll_no                                      details
0              101   {'name': 'Andew', 'age': 12, 'grade': 'A'}
1              102  {'name': 'Bhuvan', 'age': 18, 'grade': 'B'}

In [14]:
df_with_nested

   student_roll_no                                        details
0              101     {'name': 'Andew', 'age': 12, 'grade': 'A'}
1              102    {'name': 'Bhuvan', 'age': 18, 'grade': 'B'}
2              103   {'name': 'Clinton', 'age': 11, 'grade': 'A'}
3              104     {'name': 'Drake', 'age': 12, 'grade': 'C'}
4              105     {'name': 'Eisha', 'age': 13, 'grade': 'B'}
5              106    {'name': 'Farhan', 'age': 22, 'grade': 'C'}
6              107    {'name': 'Garima', 'age': 11, 'grade': 'A'}
7              108  {'name': 'Himanshu', 'age': 19, 'grade': 'A'}
8              109    {'name': 'Ishaan', 'age': 10, 'grade': 'D'}
9              110      {'name': 'Jason', 'age': 9, 'grade': 'B'}

In [15]:
import json

In [16]:
with open('dataset/json/nested.json') as f:
    my_json_data = json.load(f)

In [17]:
my_json_data

[{'student_roll_no': 101,
  'details': {'name': 'Andew', 'age': 12, 'grade': 'A'}},
 {'student_roll_no': 102,
  'details': {'name': 'Bhuvan', 'age': 18, 'grade': 'B'}},
 {'student_roll_no': 103,
  'details': {'name': 'Clinton', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 104,
  'details': {'name': 'Drake', 'age': 12, 'grade': 'C'}},
 {'student_roll_no': 105,
  'details': {'name': 'Eisha', 'age': 13, 'grade': 'B'}},
 {'student_roll_no': 106,
  'details': {'name': 'Farhan', 'age': 22, 'grade': 'C'}},
 {'student_roll_no': 107,
  'details': {'name': 'Garima', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 108,
  'details': {'name': 'Himanshu', 'age': 19, 'grade': 'A'}},
 {'student_roll_no': 109,
  'details': {'name': 'Ishaan', 'age': 10, 'grade': 'D'}},
 {'student_roll_no': 110,
  'details': {'name': 'Jason', 'age': 9, 'grade': 'B'}}]

In [18]:
from pprint import pprint
pprint(my_json_data)

[{'details': {'age': 12, 'grade': 'A', 'name': 'Andew'},
  'student_roll_no': 101},
 {'details': {'age': 18, 'grade': 'B', 'name': 'Bhuvan'},
  'student_roll_no': 102},
 {'details': {'age': 11, 'grade': 'A', 'name': 'Clinton'},
  'student_roll_no': 103},
 {'details': {'age': 12, 'grade': 'C', 'name': 'Drake'},
  'student_roll_no': 104},
 {'details': {'age': 13, 'grade': 'B', 'name': 'Eisha'},
  'student_roll_no': 105},
 {'details': {'age': 22, 'grade': 'C', 'name': 'Farhan'},
  'student_roll_no': 106},
 {'details': {'age': 11, 'grade': 'A', 'name': 'Garima'},
  'student_roll_no': 107},
 {'details': {'age': 19, 'grade': 'A', 'name': 'Himanshu'},
  'student_roll_no': 108},
 {'details': {'age': 10, 'grade': 'D', 'name': 'Ishaan'},
  'student_roll_no': 109},
 {'details': {'age': 9, 'grade': 'B', 'name': 'Jason'}, 'student_roll_no': 110}]

In [19]:
data_0 = my_json_data[0]

In [20]:
data_0

{'student_roll_no': 101, 'details': {'name': 'Andew', 'age': 12, 'grade': 'A'}}

In [21]:
data_0['details']

{'name': 'Andew', 'age': 12, 'grade': 'A'}

In [22]:
data_0['details']['age']

12

In [23]:
for data in my_json_data:
    print(data['details']['age'])

12
18
11
12
13
22
11
19
10
9

In [24]:
filtered_data = []
for data in my_json_data:
    filtered_variable = {}
    if data['details']['age'] > 15:
        filtered_variable['age'] = data['details']['age']
        filtered_variable['name'] = data['details']['name']
        filtered_data.append(filtered_variable)

In [25]:
filtered_data

[{'age': 18, 'name': 'Bhuvan'},
 {'age': 22, 'name': 'Farhan'},
 {'age': 19, 'name': 'Himanshu'}]

In [27]:
with open('dataset/json/filtered.json', 'w') as f:
    json.dump(filtered_data, f, indent=4)